Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28CLD1G.atdf
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZQ">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0xFC069000"/>
            <parameters>
              <param name="INSTANCE_ID" value="78"/>
            </parameters>
          </instance>
        </module>
        <module name="CLASSD" id="11283" version="G">
          <instance name="CLASSD">
            <register-group address-space="base" name="CLASSD" name-in-module="CLASSD" offset="0xFC048000"/>
            <parameters>
              <param name="INSTANCE_ID" value="59"/>
              <param name="CLOCK_ID" value="59"/>
              <param name="DMAC_ID_TX" value="47"/>
            </parameters>
            <signals>
              <signal pad="PA28" function="F" group="CLASSD_L" index="0"/>
              <signal pad="PA29" function="F" group="CLASSD_L" index="1"/>
              <signal pad="PA30" function="F" group="CLASSD_L" index="2"/>
              <signal pad="PA31" function="F" group="CLASSD_L" index="3"/>
              <signal pad="PB1" function="F" group="CLASSD_R" index="0"/>
              <signal pad="PB2" function="F" group="CLASSD_R" index="1"/>
              <signal pad="PB3" function="F" group="CLASSD_R" index="2"/>
              <signal pad="PB4" function="F" group="CLASSD_R" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="FLEXCOM" id="11268" version="P">
          <instance name="FLEXCOM0">
            <register-group address-space="base" name="FLEXCOM0" name-in-module="FLEXCOM" offset="0xF8034000"/>
            <parameters>
              <param name="INSTANCE_ID" value="19"/>
              <param name="CLOCK_ID" value="19"/>
              <param name="DMAC_ID_TX" value="11"/>
              <param name="DMAC_ID_RX" value="12"/>
            </parameters>
            <signals>
              <signal pad="PB28" function="C" group="FLEXCOM0_IO" index="0"/>
              <signal pad="PB29" function="C" group="FLEXCOM0_IO" index="1"/>
              <signal pad="PB30" function="C" group="FLEXCOM0_IO" index="2"/>
              <signal pad="PB31" function="C" group="FLEXCOM0_IO" index="3"/>
              <signal pad="PC0" function="C" group="FLEXCOM0_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM1">
            <register-group address-space="base" name="FLEXCOM1" name-in-module="FLEXCOM" offset="0xF8038000"/>
            <parameters>
              <param name="INSTANCE_ID" value="20"/>
              <param name="CLOCK_ID" value="20"/>
              <param name="DMAC_ID_TX" value="13"/>
              <param name="DMAC_ID_RX" value="14"/>
            </parameters>
            <signals>
              <signal pad="PA24" function="A" group="FLEXCOM1_IO" index="0"/>
              <signal pad="PA23" function="A" group="FLEXCOM1_IO" index="1"/>
              <signal pad="PA22" function="A" group="FLEXCOM1_IO" index="2"/>
              <signal pad="PA25" function="A" group="FLEXCOM1_IO" index="3"/>
              <signal pad="PA26" function="A" group="FLEXCOM1_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM2">
            <register-group address-space="base" name="FLEXCOM2" name-in-module="FLEXCOM" offset="0xFC010000"/>
            <parameters>
              <param name="INSTANCE_ID" value="21"/>
              <param name="CLOCK_ID" value="21"/>
              <param name="DMAC_ID_TX" value="15"/>
              <param name="DMAC_ID_RX" value="16"/>
            </parameters>
            <signals>
              <signal pad="PA6" function="E" group="FLEXCOM2_IO" index="0"/>
              <signal pad="PD26" function="C" group="FLEXCOM2_IO" index="0"/>
              <signal pad="PA7" function="E" group="FLEXCOM2_IO" index="1"/>
              <signal pad="PD27" function="C" group="FLEXCOM2_IO" index="1"/>
              <signal pad="PA8" function="E" group="FLEXCOM2_IO" index="2"/>
              <signal pad="PD28" function="C" group="FLEXCOM2_IO" index="2"/>
              <signal pad="PA9" function="E" group="FLEXCOM2_IO" index="3"/>
              <signal pad="PD29" function="C" group="FLEXCOM2_IO" index="3"/>
              <signal pad="PA10" function="E" group="FLEXCOM2_IO" index="4"/>
              <signal pad="PD30" function="C" group="FLEXCOM2_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM3">
            <register-group address-space="base" name="FLEXCOM3" name-in-module="FLEXCOM" offset="0xFC014000"/>
            <parameters>
              <param name="INSTANCE_ID" value="22"/>
              <param name="CLOCK_ID" value="22"/>
              <param name="DMAC_ID_TX" value="17"/>
              <param name="DMAC_ID_RX" value="18"/>
            </parameters>
            <signals>
              <signal pad="PA15" function="E" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PB23" function="E" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PC20" function="E" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PA13" function="E" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PB22" function="E" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PC19" function="E" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PA14" function="E" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PB21" function="E" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PC18" function="E" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PA16" function="E" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PB24" function="E" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PC21" function="E" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PA17" function="E" group="FLEXCOM3_IO" index="4"/>
              <signal pad="PB25" function="E" group="FLEXCOM3_IO" index="4"/>
              <signal pad="PC22" function="E" group="FLEXCOM3_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM4">
            <register-group address-space="base" name="FLEXCOM4" name-in-module="FLEXCOM" offset="0xFC018000"/>
            <parameters>
              <param name="INSTANCE_ID" value="23"/>
              <param name="CLOCK_ID" value="23"/>
              <param name="DMAC_ID_TX" value="19"/>
              <param name="DMAC_ID_RX" value="20"/>
            </parameters>
            <signals>
              <signal pad="PC28" function="B" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PD12" function="B" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PD21" function="C" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PC29" function="B" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PD13" function="B" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PD22" function="C" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PC30" function="B" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PD14" function="B" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PD23" function="C" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PC31" function="B" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PD15" function="B" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PD24" function="C" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PD0" function="B" group="FLEXCOM4_IO" index="4"/>
              <signal pad="PD16" function="B" group="FLEXCOM4_IO" index="4"/>
              <signal pad="PD25" function="C" group="FLEXCOM4_IO" index="4"/>
            </signals>
          </instance>
        </module>
        <module name="GMAC" id="44152" version="A">
          <instance name="GMAC">
            <register-group address-space="base" name="GMAC" name-in-module="GMAC" offset="0xF8008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="5"/>
              <param name="CLOCK_ID" value="5"/>
            </parameters>
            <signals>
              <signal pad="PB9" function="F" group="GCOL"/>
              <signal pad="PC23" function="B" group="GCOL"/>
              <signal pad="PD4" function="D" group="GCOL"/>
              <signal pad="PB8" function="F" group="GCRS"/>
              <signal pad="PC22" function="B" group="GCRS"/>
              <signal pad="PD3" function="D" group="GCRS"/>
              <signal pad="PB22" function="F" group="GMDC"/>
              <signal pad="PC18" function="B" group="GMDC"/>
              <signal pad="PD17" function="D" group="GMDC"/>
              <signal pad="PB23" function="F" group="GMDIO"/>
              <signal pad="PC19" function="B" group="GMDIO"/>
              <signal pad="PD18" function="D" group="GMDIO"/>
              <signal pad="PB7" function="F" group="GRXCK"/>
              <signal pad="PC20" function="B" group="GRXCK"/>
              <signal pad="PD1" function="D" group="GRXCK"/>
              <signal pad="PB16" function="F" group="GRXDV"/>
              <signal pad="PC12" function="B" group="GRXDV"/>
              <signal pad="PD11" function="D" group="GRXDV"/>
              <signal pad="PB17" function="F" group="GRXER"/>
              <signal pad="PC13" function="B" group="GRXER"/>
              <signal pad="PD12" function="D" group="GRXER"/>
              <signal pad="PB18" function="F" group="GRX" index="0"/>
              <signal pad="PC14" function="B" group="GRX" index="0"/>
              <signal pad="PD13" function="D" group="GRX" index="0"/>
              <signal pad="PB19" function="F" group="GRX" index="1"/>
              <signal pad="PC15" function="B" group="GRX" index="1"/>
              <signal pad="PD14" function="D" group="GRX" index="1"/>
              <signal pad="PB10" function="F" group="GRX" index="2"/>
              <signal pad="PC24" function="B" group="GRX" index="2"/>
              <signal pad="PD5" function="D" group="GRX" index="2"/>
              <signal pad="PB11" function="F" group="GRX" index="3"/>
              <signal pad="PC25" function="B" group="GRX" index="3"/>
              <signal pad="PD6" function="D" group="GRX" index="3"/>
              <signal pad="PB5" function="F" group="GTSUCOMP"/>
              <signal pad="PC9" function="B" group="GTSUCOMP"/>
              <signal pad="PD0" function="D" group="GTSUCOMP"/>
              <signal pad="PB14" function="F" group="GTXCK"/>
              <signal pad="PC10" function="B" group="GTXCK"/>
              <signal pad="PD9" function="D" group="GTXCK"/>
              <signal pad="PB15" function="F" group="GTXEN"/>
              <signal pad="PC11" function="B" group="GTXEN"/>
              <signal pad="PD10" function="D" group="GTXEN"/>
              <signal pad="PB6" function="F" group="GTXER"/>
              <signal pad="PC21" function="B" group="GTXER"/>
              <signal pad="PD2" function="D" group="GTXER"/>
              <signal pad="PB20" function="F" group="GTX" index="0"/>
              <signal pad="PC16" function="B" group="GTX" index="0"/>
              <signal pad="PD15" function="D" group="GTX" index="0"/>
              <signal pad="PB21" function="F" group="GTX" index="1"/>
              <signal pad="PC17" function="B" group="GTX" index="1"/>
              <signal pad="PD16" function="D" group="GTX" index="1"/>
              <signal pad="PB12" function="F" group="GTX" index="2"/>
              <signal pad="PC26" function="B" group="GTX" index="2"/>
              <signal pad="PD7" function="D" group="GTX" index="2"/>
              <signal pad="PB13" function="F" group="GTX" index="3"/>
              <signal pad="PC27" function="B" group="GTX" index="3"/>
              <signal pad="PD8" function="D" group="GTX" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="I2SC" id="11241" version="N">
          <instance name="I2SC0">
            <register-group address-space="base" name="I2SC0" name-in-module="I2SC" offset="0xF8050000"/>
            <parameters>
              <param name="INSTANCE_ID" value="54"/>
              <param name="CLOCK_ID" value="54"/>
              <param name="DMAC_ID_TX" value="31"/>
              <param name="DMAC_ID_RX" value="32"/>
            </parameters>
            <signals>
              <signal pad="PC1" function="E" group="I2SC0_CK"/>
              <signal pad="PD19" function="E" group="I2SC0_CK"/>
              <signal pad="PC4" function="E" group="I2SC0_DI" index="0"/>
              <signal pad="PD22" function="E" group="I2SC0_DI" index="0"/>
              <signal pad="PC5" function="E" group="I2SC0_DO" index="0"/>
              <signal pad="PD23" function="E" group="I2SC0_DO" index="0"/>
              <signal pad="PC2" function="E" group="I2SC0_MCK"/>
              <signal pad="PD20" function="E" group="I2SC0_MCK"/>
              <signal pad="PC3" function="E" group="I2SC0_WS"/>
              <signal pad="PD21" function="E" group="I2SC0_WS"/>
            </signals>
          </instance>
          <instance name="I2SC1">
            <register-group address-space="base" name="I2SC1" name-in-module="I2SC" offset="0xFC04C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="55"/>
              <param name="CLOCK_ID" value="55"/>
              <param name="DMAC_ID_TX" value="33"/>
              <param name="DMAC_ID_RX" value="34"/>
            </parameters>
            <signals>
              <signal pad="PA15" function="D" group="I2SC1_CK"/>
              <signal pad="PB15" function="D" group="I2SC1_CK"/>
              <signal pad="PA17" function="D" group="I2SC1_DI" index="0"/>
              <signal pad="PB17" function="D" group="I2SC1_DI" index="0"/>
              <signal pad="PA18" function="D" group="I2SC1_DO" index="0"/>
              <signal pad="PB18" function="D" group="I2SC1_DO" index="0"/>
              <signal pad="PA14" function="D" group="I2SC1_MCK"/>
              <signal pad="PB14" function="D" group="I2SC1_MCK"/>
              <signal pad="PA16" function="D" group="I2SC1_WS"/>
              <signal pad="PB16" function="D" group="I2SC1_WS"/>
            </signals>
          </instance>
        </module>
