Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28CLD1G.atdf
        <register caption="512 to 1023 Byte Frames Received Register" name="GMAC_TBFR1023" offset="0x178" rw="R" size="4">
          <bitfield caption="512 to 1023 Byte Frames Received without Error" mask="0xFFFFFFFF" name="NFRX"/>
        </register>
        <register caption="1024 to 1518 Byte Frames Received Register" name="GMAC_TBFR1518" offset="0x17C" rw="R" size="4">
          <bitfield caption="1024 to 1518 Byte Frames Received without Error" mask="0xFFFFFFFF" name="NFRX"/>
        </register>
        <register caption="1519 to Maximum Byte Frames Received Register" name="GMAC_TMXBFR" offset="0x180" rw="R" size="4">
          <bitfield caption="1519 to Maximum Byte Frames Received without Error" mask="0xFFFFFFFF" name="NFRX"/>
        </register>
        <register caption="Undersize Frames Received Register" name="GMAC_UFR" offset="0x184" rw="R" size="4">
          <bitfield caption="Undersize Frames Received" mask="0x000003FF" name="UFRX"/>
        </register>
        <register caption="Oversize Frames Received Register" name="GMAC_OFR" offset="0x188" rw="R" size="4">
          <bitfield caption="Oversized Frames Received" mask="0x000003FF" name="OFRX"/>
        </register>
        <register caption="Jabbers Received Register" name="GMAC_JR" offset="0x18C" rw="R" size="4">
          <bitfield caption="Jabbers Received" mask="0x000003FF" name="JRX"/>
        </register>
        <register caption="Frame Check Sequence Errors Register" name="GMAC_FCSE" offset="0x190" rw="R" size="4">
          <bitfield caption="Frame Check Sequence Errors" mask="0x000003FF" name="FCKR"/>
        </register>
        <register caption="Length Field Frame Errors Register" name="GMAC_LFFE" offset="0x194" rw="R" size="4">
          <bitfield caption="Length Field Frame Errors" mask="0x000003FF" name="LFER"/>
        </register>
        <register caption="Receive Symbol Errors Register" name="GMAC_RSE" offset="0x198" rw="R" size="4">
          <bitfield caption="Receive Symbol Errors" mask="0x000003FF" name="RXSE"/>
        </register>
        <register caption="Alignment Errors Register" name="GMAC_AE" offset="0x19C" rw="R" size="4">
          <bitfield caption="Alignment Errors" mask="0x000003FF" name="AER"/>
        </register>
        <register caption="Receive Resource Errors Register" name="GMAC_RRE" offset="0x1A0" rw="R" size="4">
          <bitfield caption="Receive Resource Errors" mask="0x0003FFFF" name="RXRER"/>
        </register>
        <register caption="Receive Overrun Register" name="GMAC_ROE" offset="0x1A4" rw="R" size="4">
          <bitfield caption="Receive Overruns" mask="0x000003FF" name="RXOVR"/>
        </register>
        <register caption="IP Header Checksum Errors Register" name="GMAC_IHCE" offset="0x1A8" rw="R" size="4">
          <bitfield caption="IP Header Checksum Errors" mask="0x000000FF" name="HCKER"/>
        </register>
        <register caption="TCP Checksum Errors Register" name="GMAC_TCE" offset="0x1AC" rw="R" size="4">
          <bitfield caption="TCP Checksum Errors" mask="0x000000FF" name="TCKER"/>
        </register>
        <register caption="UDP Checksum Errors Register" name="GMAC_UCE" offset="0x1B0" rw="R" size="4">
          <bitfield caption="UDP Checksum Errors" mask="0x000000FF" name="UCKER"/>
        </register>
        <register caption="1588 Timer Increment Sub-nanoseconds Register" name="GMAC_TISUBN" offset="0x1BC" rw="RW" size="4">
          <bitfield caption="Lower Significant Bits of Timer Increment Register" mask="0x0000FFFF" name="LSBTIR"/>
        </register>
        <register caption="1588 Timer Seconds High Register" name="GMAC_TSH" offset="0x1C0" rw="RW" size="4">
          <bitfield caption="Timer Count in Seconds" mask="0x0000FFFF" name="TCS"/>
        </register>
        <register caption="1588 Timer Seconds Low Register" name="GMAC_TSL" offset="0x1D0" rw="RW" size="4">
          <bitfield caption="Timer Count in Seconds" mask="0xFFFFFFFF" name="TCS"/>
        </register>
        <register caption="1588 Timer Nanoseconds Register" name="GMAC_TN" offset="0x1D4" rw="RW" size="4">
          <bitfield caption="Timer Count in Nanoseconds" mask="0x3FFFFFFF" name="TNS"/>
        </register>
        <register caption="1588 Timer Adjust Register" name="GMAC_TA" offset="0x1D8" rw="W" size="4">
          <bitfield caption="Increment/Decrement" mask="0x3FFFFFFF" name="ITDT"/>
          <bitfield caption="Adjust 1588 Timer" mask="0x80000000" name="ADJ"/>
        </register>
        <register caption="1588 Timer Increment Register" name="GMAC_TI" offset="0x1DC" rw="RW" size="4">
          <bitfield caption="Count Nanoseconds" mask="0x000000FF" name="CNS"/>
          <bitfield caption="Alternative Count Nanoseconds" mask="0x0000FF00" name="ACNS"/>
          <bitfield caption="Number of Increments" mask="0x00FF0000" name="NIT"/>
        </register>
        <register caption="PTP Event Frame Transmitted Seconds Low Register" name="GMAC_EFTSL" offset="0x1E0" rw="R" size="4">
          <bitfield caption="Register Update" mask="0xFFFFFFFF" name="RUD"/>
        </register>
        <register caption="PTP Event Frame Transmitted Nanoseconds Register" name="GMAC_EFTN" offset="0x1E4" rw="R" size="4">
          <bitfield caption="Register Update" mask="0x3FFFFFFF" name="RUD"/>
        </register>
        <register caption="PTP Event Frame Received Seconds Low Register" name="GMAC_EFRSL" offset="0x1E8" rw="R" size="4">
          <bitfield caption="Register Update" mask="0xFFFFFFFF" name="RUD"/>
        </register>
        <register caption="PTP Event Frame Received Nanoseconds Register" name="GMAC_EFRN" offset="0x1EC" rw="R" size="4">
          <bitfield caption="Register Update" mask="0x3FFFFFFF" name="RUD"/>
        </register>
        <register caption="PTP Peer Event Frame Transmitted Seconds Low Register" name="GMAC_PEFTSL" offset="0x1F0" rw="R" size="4">
          <bitfield caption="Register Update" mask="0xFFFFFFFF" name="RUD"/>
        </register>
        <register caption="PTP Peer Event Frame Transmitted Nanoseconds Register" name="GMAC_PEFTN" offset="0x1F4" rw="R" size="4">
          <bitfield caption="Register Update" mask="0x3FFFFFFF" name="RUD"/>
        </register>
        <register caption="PTP Peer Event Frame Received Seconds Low Register" name="GMAC_PEFRSL" offset="0x1F8" rw="R" size="4">
          <bitfield caption="Register Update" mask="0xFFFFFFFF" name="RUD"/>
        </register>
