Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28CLD1G.atdf
      <value-group caption="DRAM Architecture (read-only)" name="MPDDRC_MD__TYPE">
        <value caption="4n prefetch architecture" name="S4_SDRAM" value="0x0"/>
        <value caption="2n prefetch architecture" name="S2_SDRAM" value="0x1"/>
        <value caption="Non-volatile device" name="NVM" value="0x2"/>
        <value caption="8n prefetch architecture" name="S8_SDRAM" value="0x3"/>
      </value-group>
      <value-group caption="Density of Memory (read-only)" name="MPDDRC_MD__DENSITY">
        <value caption="The device density is 64 Mbits." name="DENSITY_64MBITS" value="0x0"/>
        <value caption="The device density is 128 Mbits." name="DENSITY_128MBITS" value="0x1"/>
        <value caption="The device density is 256 Mbits." name="DENSITY_256MBITS" value="0x2"/>
        <value caption="The device density is 512 Mbits." name="DENSITY_512MBITS" value="0x3"/>
        <value caption="The device density is 1 Gbit." name="DENSITY_1GBITS" value="0x4"/>
        <value caption="The device density is 2 Gbits." name="DENSITY_2GBITS" value="0x5"/>
        <value caption="The device density is 4 Gbits." name="DENSITY_4GBITS" value="0x6"/>
        <value caption="The device density is 8 Gbits." name="DENSITY_8GBITS" value="0x7"/>
        <value caption="The device density is 16 Gbits." name="DENSITY_16GBITS" value="0x8"/>
        <value caption="The device density is 32 Gbits." name="DENSITY_32GBITS" value="0x9"/>
      </value-group>
      <value-group caption="Width of Memory (read-only)" name="MPDDRC_MD__IO_WIDTH">
        <value caption="The data bus width is 32 bits." name="WIDTH_32" value="0x0"/>
        <value caption="The data bus width is 16 bits." name="WIDTH_16" value="0x1"/>
        <value caption="The data bus width is 8 bits." name="WIDTH_8" value="0x2"/>
        <value caption="-" name="NOT_USED" value="0x3"/>
      </value-group>
      <value-group caption="Drive Strength" name="MPDDRC_LPDDR23_LPR__DS">
        <value caption="34.3 ohm typical" name="DS_34_3" value="0x1"/>
        <value caption="40 ohm typical (default)" name="DS_40" value="0x2"/>
        <value caption="48 ohm typical" name="DS_48" value="0x3"/>
        <value caption="60 ohm typical" name="DS_60" value="0x4"/>
        <value caption="80 ohm typical" name="DS_80" value="0x6"/>
        <value caption="120 ohm typical" name="DS_120" value="0x7"/>
      </value-group>
      <value-group caption="Built-in Self-Test for RZQ Information (read-only)" name="MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL__RZQI">
        <value caption="RZQ self test not supported" name="RZQ_NOT_SUPPORTED" value="0x0"/>
        <value caption="The ZQ pin can be connected to VDDCA or left floating." name="ZQ_VDDCA_FLOAT" value="0x1"/>
        <value caption="The ZQ pin can be shorted to ground." name="ZQ_SHORTED_GROUND" value="0x2"/>
        <value caption="ZQ pin self test complete; no error condition detected" name="ZQ_SELF_TEST_OK" value="0x3"/>
      </value-group>
      <value-group caption="Resistor Divider, Output Driver Impedance" name="MPDDRC_IO_CALIBR__RDIV">
        <value caption="LPDDR2 serial impedance line = 34.3 ohms,DDR2/LPDDR1 serial impedance line: Not applicable" name="RZQ_34" value="0x1"/>
        <value caption="LPDDR2 serial impedance line = 40 ohms,LPDDR3 serial impedance line = 38 ohms,DDR3 serial impedance line = 37 ohms,DDR2/LPDDR1 serial impedance line = 35 ohms" name="RZQ_40_RZQ_38_RZQ_37_RZQ_35" value="0x2"/>
        <value caption="LPDDR2 serial impedance line = 48 ohms,LPDDR3 serial impedance line = 46 ohms,DDR3 serial impedance line = 44 ohms,DDR2/LPDDR1 serial impedance line = 43 ohms" name="RZQ_48_RZQ_46_RZQ_44_RZQ_43" value="0x3"/>
        <value caption="LPDDR2 serial impedance line = 60 ohms,LPDDR3 serial impedance line = 57 ohms,DDR3 serial impedance line = 55 ohms,DDR2/LPDDR1 serial impedance line = 52 ohms" name="RZQ_60_RZQ_57_RZQ_55_RZQ_52" value="0x4"/>
        <value caption="LPDDR2 serial impedance line = 80 ohms,LPDDR3 serial impedance line = 77 ohms,DDR3 serial impedance line = 73 ohms,DDR2/LPDDR1 serial impedance line = 70 ohms" name="RZQ_80_RZQ_77_RZQ_73_RZQ_70" value="0x6"/>
        <value caption="LPDDR2 serial impedance line = 120 ohms,LPDDR3 serial impedance line = 115 ohms,DDR3 serial impedance line = 110 ohms,DDR2/LPDDR1 serial impedance line = 105 ohms" name="RZQ_120_RZQ_115_RZQ_110_RZQ_105" value="0x7"/>
      </value-group>
      <value-group caption="Enable Calibration" name="MPDDRC_IO_CALIBR__EN_CALIB">
        <value caption="Calibration is disabled." name="DISABLE_CALIBRATION" value="0"/>
        <value caption="Calibration is enabled." name="ENABLE_CALIBRATION" value="1"/>
      </value-group>
      <value-group caption="Type of Arbitration" name="MPDDRC_CONF_ARBITER__ARB">
        <value caption="Round Robin" name="ROUND" value="0x0"/>
        <value caption="Request Policy" name="NB_REQUEST" value="0x1"/>
        <value caption="Bandwidth Policy" name="BANDWIDTH" value="0x2"/>
      </value-group>
      <value-group caption="Shift Sampling Point of Data" name="MPDDRC_RD_DATA_PATH__SHIFT_SAMPLING">
        <value caption="Initial sampling point." name="NO_SHIFT" value="0x0"/>
        <value caption="Sampling point is shifted by one cycle." name="SHIFT_ONE_CYCLE" value="0x1"/>
        <value caption="Sampling point is shifted by two cycles." name="SHIFT_TWO_CYCLES" value="0x2"/>
        <value caption="Sampling point is shifted by three cycles, unique for LPDDR2 and DDR3 and LPDDR3.Not applicable for DDR2 and LPDDR1 devices." name="SHIFT_THREE_CYCLES" value="0x3"/>
      </value-group>
      <value-group caption="Read/Write Access" name="MPDDRC_MCFGR__READ_WRITE">
        <value caption="Read and Write accesses are triggered." name="TRIG_RD_WR" value="0x0"/>
        <value caption="Only Write accesses are triggered." name="TRIG_WR" value="0x1"/>
        <value caption="Only Read accesses are triggered." name="TRIG_RD" value="0x2"/>
      </value-group>
      <value-group caption="Information Type" name="MPDDRC_MCFGR__INFO">
        <value caption="Information concerning the transfer with the longest waiting time" name="MAX_WAIT" value="0x0"/>
        <value caption="Number of transfers on the port" name="NB_TRANSFERS" value="0x1"/>
        <value caption="Total latency on the port" name="TOTAL_LATENCY" value="0x2"/>
      </value-group>
      <value-group caption="Type of Burst on Port x [x = 0..7]" name="MPDDRC_MINFO0__BURST">
        <value caption="Single transfer" name="SINGLE" value="0x0"/>
        <value caption="Incrementing burst of unspecified length" name="INCR" value="0x1"/>
        <value caption="4-beat wrapping burst" name="WRAP4" value="0x2"/>
        <value caption="4-beat incrementing burst" name="INCR4" value="0x3"/>
        <value caption="8-beat wrapping burst" name="WRAP8" value="0x4"/>
        <value caption="8-beat incrementing burst" name="INCR8" value="0x5"/>
        <value caption="16-beat wrapping burst" name="WRAP16" value="0x6"/>
        <value caption="16-beat incrementing burst" name="INCR16" value="0x7"/>
      </value-group>
