Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28CLD1G.atdf
        <register caption="SleepWalking Enable Register 1" name="PMC_SLPWK_ER1" offset="0x0134" rw="W" size="4">
          <bitfield caption="Peripheral 33 SleepWalking Enable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral 34 SleepWalking Enable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral 40 SleepWalking Enable" mask="0x00000100" name="PID40"/>
        </register>
        <register caption="SleepWalking Disable Register 1" name="PMC_SLPWK_DR1" offset="0x0138" rw="W" size="4">
          <bitfield caption="Peripheral 33 SleepWalking Disable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral 34 SleepWalking Disable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral 40 SleepWalking Disable" mask="0x00000100" name="PID40"/>
        </register>
        <register caption="SleepWalking Status Register 1" name="PMC_SLPWK_SR1" offset="0x013C" rw="R" size="4">
          <bitfield caption="Peripheral 33 SleepWalking Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral 34 SleepWalking Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral 40 SleepWalking Status" mask="0x00000100" name="PID40"/>
        </register>
        <register caption="SleepWalking Activity Status Register 1" name="PMC_SLPWK_ASR1" offset="0x0140" rw="R" size="4">
          <bitfield caption="Peripheral 33 Activity Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral 34 Activity Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral 40 Activity Status" mask="0x00000100" name="PID40"/>
        </register>
        <register caption="SleepWalking Activity In Progress Register" name="PMC_SLPWK_AIPR" offset="0x0144" rw="R" size="4">
          <bitfield caption="Activity In Progress" mask="0x00000001" name="AIP"/>
        </register>
        <register caption="SleepWalking Control Register" name="PMC_SLPWKCR" offset="0x0148" rw="RW" size="4">
          <bitfield caption="Peripheral ID" mask="0x0000007F" name="PID"/>
          <bitfield caption="Command" mask="0x00001000" name="CMD"/>
          <bitfield caption="Activity Status Register" mask="0x00010000" name="ASR"/>
          <bitfield caption="SleepWalking Status Register" mask="0x10000000" name="SLPWKSR"/>
        </register>
        <register caption="Audio PLL Register 0" name="PMC_AUDIO_PLL0" offset="0x014C" rw="RW" size="4">
          <bitfield caption="PLL Enable" mask="0x00000001" name="PLLEN"/>
          <bitfield caption="Pad Clock Enable" mask="0x00000002" name="PADEN"/>
          <bitfield caption="PMC Clock Enable" mask="0x00000004" name="PMCEN"/>
          <bitfield caption="Audio PLL Reset" mask="0x00000008" name="RESETN"/>
          <bitfield caption="PLL Loop Filter Selection" mask="0x000000F0" name="PLLFLT"/>
          <bitfield caption="Loop Divider Ratio" mask="0x00007F00" name="ND"/>
          <bitfield caption="Output Divider Ratio for PMC Clock" mask="0x007F0000" name="QDPMC"/>
          <bitfield caption="Digitally Controlled Oscillator Filter Selection" mask="0x0F000000" name="DCO_FILTER"/>
          <bitfield caption="Digitally Controlled Oscillator Gain Selection" mask="0x30000000" name="DCO_GAIN"/>
        </register>
        <register caption="Audio PLL Register 1" name="PMC_AUDIO_PLL1" offset="0x0150" rw="RW" size="4">
          <bitfield caption="Fractional Loop Divider Setting" mask="0x003FFFFF" name="FRACR"/>
          <bitfield caption="Divider Value" mask="0x03000000" name="DIV" values="PMC_AUDIO_PLL1__DIV"/>
          <bitfield caption="Output Divider Ratio for Pad Clock" mask="0x7C000000" name="QDAUDIO"/>
        </register>
      </register-group>
      <value-group caption="Password" name="CKGR_MOR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0x37"/>
      </value-group>
      <value-group caption="Master/Processor Clock Source Selection" name="PMC_MCKR__CSS">
        <value caption="Slow clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLACK is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
      </value-group>
      <value-group caption="Master/Processor Clock Prescaler" name="PMC_MCKR__PRES">
        <value caption="Selected clock" name="CLOCK" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLOCK_DIV2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLOCK_DIV4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLOCK_DIV8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLOCK_DIV16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLOCK_DIV32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLOCK_DIV64" value="0x6"/>
      </value-group>
      <value-group caption="Master Clock Division" name="PMC_MCKR__MDIV">
        <value caption="Master Clock is Prescaler Output Clock divided by 1.Warning: DDRCK is not available." name="EQ_PCK" value="0x0"/>
        <value caption="Master Clock is Prescaler Output Clock divided by 2. DDRCK is equal to MCK." name="PCK_DIV2" value="0x1"/>
        <value caption="Master Clock is Prescaler Output Clock divided by 4. DDRCK is equal to MCK." name="PCK_DIV4" value="0x2"/>
        <value caption="Master Clock is Prescaler Output Clock divided by 3. DDRCK is equal to MCK." name="PCK_DIV3" value="0x3"/>
      </value-group>
      <value-group caption="AHB 32-bit Matrix Divisor" name="PMC_MCKR__H32MXDIV">
        <value caption="The AHB 32-bit Matrix frequency is equal to the AHB 64-bit Matrix frequency. It is possible only if the AHB 64-bit Matrix frequency does not exceed 83 MHz." name="H32MXDIV1" value="0"/>
        <value caption="The AHB 32-bit Matrix frequency is equal to the AHB 64-bit Matrix frequency divided by 2." name="H32MXDIV2" value="1"/>
      </value-group>
      <value-group caption="Master Clock Source Selection" name="PMC_PCK__CSS">
        <value caption="Slow clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLACK is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK_CLK" value="0x4"/>
        <value caption="Audio PLL clock is selected" name="AUDIO_CLK" value="0x5"/>
      </value-group>
      <value-group caption="Write Protection Key" name="PMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x504D43"/>
      </value-group>
      <value-group caption="Generic Clock Source Selection" name="PMC_PCR__GCKCSS">
        <value caption="Slow clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLACK is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK_CLK" value="0x4"/>
        <value caption="Audio PLL clock is selected" name="AUDIO_CLK" value="0x5"/>
      </value-group>
      <value-group caption="Divider Value" name="PMC_AUDIO_PLL1__DIV">
        <value caption="Divide by 2" name="DIV2" value="0x2"/>
        <value caption="Divide by 3" name="DIV3" value="0x3"/>
      </value-group>
    </module>
    <module caption="Peripheral Touch Controller" id="44038" name="PTC" version="G">
      <register-group name="PTC">
        <register caption="PTC Command Register" name="PTC_CMD" offset="0x28" rw="W" size="1">
          <bitfield caption="Host Command" mask="0x0000000f" name="CMD" values="PTC_CMD__CMD"/>
        </register>
        <register caption="PTC Interrupt Status Register" name="PTC_ISR" offset="0x30" rw="RW" size="1">
          <bitfield caption="Notification to the Firmware" mask="0x00000001" name="NOTIFY0"/>
          <bitfield caption="IRQ0" mask="0x00000010" name="IRQ0"/>
          <bitfield caption="IRQ1" mask="0x00000020" name="IRQ1"/>
          <bitfield caption="IRQ2" mask="0x00000040" name="IRQ2"/>
          <bitfield caption="IRQ3" mask="0x00000080" name="IRQ3"/>
        </register>
        <register caption="PTC Enable Register" name="PTC_IED" offset="0x35" rw="W" size="1">
          <bitfield caption="IER0" mask="0x00000010" name="IER0"/>
          <bitfield caption="IER1" mask="0x00000020" name="IER1"/>
          <bitfield caption="IER2" mask="0x00000040" name="IER2"/>
          <bitfield caption="IER3" mask="0x00000080" name="IER3"/>
        </register>
      </register-group>
      <value-group caption="Issues commands to the pPP" name="PTC_CMD__CMD">
        <value caption="-" name="NO_ACTION" value="0x0"/>
        <value caption="Waits for ongoing execution to complete, then stops." name="STOP" value="0x1"/>
        <value caption="Stops and resets" name="REST" value="0x2"/>
        <value caption="Stops without waiting for ongoing execution to complete." name="ABORT" value="0x4"/>
        <value caption="Starts execution (from stopped state)" name="RUN" value="0x5"/>
      </value-group>
    </module>
    <module caption="Pulse Width Modulation Controller" id="6343" name="PWM" version="ZC">
      <register-group name="PWM_CH_NUM" size="32">
        <register caption="PWM Channel Mode Register" name="PWM_CMR" offset="0x0" rw="RW" size="4">
          <bitfield caption="Channel Prescaler" mask="0x0000000F" name="CPRE" values="PWM_CMR0__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG" values="PWM_CMR0__CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL" values="PWM_CMR0__CPOL"/>
          <bitfield caption="Counter Event Selection" mask="0x00000400" name="CES" values="PWM_CMR0__CES"/>
          <bitfield caption="Update Selection" mask="0x00000800" name="UPDS" values="PWM_CMR0__UPDS"/>
          <bitfield caption="Disabled Polarity Inverted" mask="0x00001000" name="DPOLI"/>
          <bitfield caption="Timer Counter Trigger Selection" mask="0x00002000" name="TCTS"/>
          <bitfield caption="Dead-Time Generator Enable" mask="0x00010000" name="DTE"/>
          <bitfield caption="Dead-Time PWMHx Output Inverted" mask="0x00020000" name="DTHI"/>
          <bitfield caption="Dead-Time PWMLx Output Inverted" mask="0x00040000" name="DTLI"/>
          <bitfield caption="Push-Pull Mode" mask="0x00080000" name="PPM"/>
        </register>
        <register caption="PWM Channel Duty Cycle Register" name="PWM_CDTY" offset="0x4" rw="RW" size="4">
          <bitfield caption="Channel Duty-Cycle" mask="0x00FFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Duty Cycle Update Register" name="PWM_CDTYUPD" offset="0x8" rw="W" size="4">
          <bitfield caption="Channel Duty-Cycle Update" mask="0x00FFFFFF" name="CDTYUPD"/>
        </register>
        <register caption="PWM Channel Period Register" name="PWM_CPRD" offset="0xC" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0x00FFFFFF" name="CPRD"/>
        </register>
